[
  {
    "name": "Final Score (2018)",
    "ratings": 2,
    "released": "2018",
    "genre": "Action",
    "plot": "After deadly terrorists abduct his niece at a soccer match, an ex-soldier with lethal fighting skills wages a one-man war to save her and prevent mass destruction.",
    "actors": "Aaron McCusker, Dave Bautista, Pierce Brosnan.",
    "cover": "./web_dev_pictures/action/final_score.jpg",
    "info": "Final Score is a movie starring Aaron McCusker, Dave Bautista, and Pierce Brosnan. After deadly terrorists abduct his niece at a soccer match..."
  },
  {
    "name": "Mission Impossible (2018)",
    "ratings": 4,
    "released": "2018",
    "genre": "Action, Adventure, Thriller",
    "plot": "Mission: Impossible - Fallout is a movie starring Tom Cruise, Henry Cavill, and Ving Rhames. Ethan Hunt and his IMF team, along with some familiar allies, race against time after a mission gone wrong.",
    "actors": "Tom Cruise, Henry Cavill, Ving Rhames, Simon Pegg.",
    "cover": "./web_dev_pictures/action/mission_impossible.jpg",
    "info": "Final"
  },
  {
    "name": "Ocean's Eight (2018)",
    "ratings": 3,
    "released": "2018",
    "genre": "Action, Comedy, Crime, Thriller",
    "plot": "Oceans Eight is a movie starring Sandra Bullock, Cate Blanchett, and Anne Hathaway. Debbie Ocean gathers an all-female crew to attempt an impossible heist at New York Citys yearly Met Gala.",
    "actors": "Sandra Bullock, Griffin Dunne, Deidre Goodwin, Daniella Rabbani.",
    "cover": "./web_dev_pictures/action/ocean_8.jpg",
    "info": "Final"
  },
  {
    "name": "The Marine 6 (2018)",
    "ratings": 2,
    "released": "2018",
    "genre": "Action",
    "plot": "After deadly terrorists abduct his niece at a soccer match, an ex-soldier with lethal fighting skills wages a one-man war to save her and prevent mass destruction.",
    "actors": "Mike 'The Miz' Mizanin, Shawn Michaels, Rebecca Quin, Louisa Connolly-Burnham.",
    "cover": "./web_dev_pictures/action/the_marine.jpg",
    "info": "Final"
  },
  {
    "name": "The Equalizer 2 (2018)",
    "ratings": 2,
    "released": "2018",
    "genre": "Action, Drama",
    "plot": "The Marine 6: Close Quarters is a movie starring Mike The Miz Mizanin, Shawn Michaels, and Rebecca Quin. Jake Carter and another former Marine, Luke Trapper, join forces to rescue a kidnapped girl from a gang.",
    "actors": "Denzel Washington, Pedro Pascal, Ashton Sanders, Orson Bean.",
    "cover": "./web_dev_pictures/comedy/the_equ_2.jpg",
    "info": "Final"
  },
  {
    "name": "Year One (2009)",
    "ratings": 1,
    "released": "2018",
    "genre": "Adventure, Comedy",
    "plot": "Year One is a movie starring Jack Black, Michael Cera, and Olivia Wilde. After being banished from their tribe, two hunter-gatherers encounter Biblical characters and eventually wind up in the city of Sodom.",
    "actors": "Jack Black, Michael Cera, Oliver Platt, David Cross, Christopher Mintz-Plasse.",
    "cover": "./web_dev_pictures/comedy/year_one.jpg",
    "info": "Final"
  },
  {
    "name": "Yes Man (2008)",
    "ratings": 3,
    "released": "2018",
    "genre": "Comedy, Romance",
    "plot": "Yes Man is a movie starring Jim Carrey, Zooey Deschanel, and Bradley Cooper. A man challenges himself to say yes to everything for an entire year.",
    "actors": "Jim Carrey, Zooey Deschanel, Bradley Cooper, John Michael Higgins.",
    "cover": "./web_dev_pictures/comedy/yes_man.jpg",
    "info": "Final"
  },
  {
    "name": "The Wedding Singer (1998)",
    "ratings": 4,
    "released": "2018",
    "genre": "Comedy, Music, Romance",
    "plot": "The Wedding Singer is a movie starring Adam Sandler, Drew Barrymore, and Christine Taylor. Robbie, a singer, and Julia, a waitress, are both engaged, but to the wrong people. Fortune intervenes to help them discover each other.",
    "actors": "Adam Sandler, Drew Barrymore, Christine Taylor, Allen Covert.",
    "cover": "./web_dev_pictures/comedy/the_singer.jpg",
    "info": "Final"
  }
]